import os
os.system('clear')

text = ['''Секунды   : 9,999,999,999,999 | Профиль : Catalyst
Минуты    : 282               | Уровень : 2,390
Часы      : 2                 | Доллары : 523,421,432,234$

< Ресурсы >

Камень    : [######....] 60%  | \033[32ml: 1000\033[0m | 134$
Дерево    : [###.......] 30%  | \033[32ml: 1111\033[0m | 2,340$
Уголь     : [###.......] 300% | \033[32ml: 10\033[0m   | 100,345$
Ткань     : [..........] 1%   | \033[32ml: 56\033[0m   | 50,345$
Медь      : [#######...] 75%  | \033[32ml: 1\033[0m    | 10,350$ 
Железо    : [########..] 89%  | \033[31ml: 122\033[0m  | 20,345$
Золото    : [#.........] 1%   | \033[32ml: 9999\033[0m | 303,450$
Уран      : [##########] 100% | \033[32ml: 2\033[0m    | 981,923,324,000,000,000,000$
Кремнелит : [##........] 100% | \033[31ml: 220\033[0m  | 18,031,324$

Действие  : 
''', '''Секунды   : 9,999,999,999,999 | Профиль : Catalyst
Минуты    : 282               | Уровень : 2,390
Часы      : 2                 | Доллары : 523,421,432,234$

< Цвета >

█ Белый краситель           1 \033[0m| ███████ | max   | 
\033[2m█ Серый краситель           2 \033[0m| \033[2m███     \033[0m| 24 ч  |
\033[31m█ Красный краситель         3 \033[0m| \033[31m██      \033[0m| 48 ч  |
\033[33m█ Желтый краситель          4 \033[0m| \033[33m█       \033[0m| 72 ч  |
\033[32m█ Зелёный краситель         5 \033[0m| \033[32m█████   \033[0m| 96 ч  |
\033[36m█ Бирюзовый краситель       6 \033[0m| \033[36m██      \033[0m| 120 ч |
\033[34m█ Синий краситель           7 \033[0m| \033[34m█       \033[0m| 144 ч |
\033[35m█ Фиолетовый краситель      8 \033[0m| \033[35m        \033[0m| 168 ч |

Действие  : 
''','''Секунды   : 9,999,999,999,999 | Профиль : Catalyst
Минуты    : 282               | Уровень : 2,390
Часы      : 2                 | Доллары : 523,421,432,234$

< 5. Медь >

Колличество : 21,840 
Хранилище   : 145,816 
Стоимость 1 : 888$ 
В секунду   : 22.4 
Уровень     : 220 

Улучшение
\033[32m
Хранилище   : +330
Стоимость 1 : +4
В секунду   : +0.1

Цена улучшения : 53,370,760$
Доллары        : 338,791,019$
\033[0m
Действие  : 
''', '''Секунды   : 9,999,999,999,999 | Профиль : Catalyst
Минуты    : 282               | Уровень : 2,390
Часы      : 2                 | Доллары : 523,421,432,234$

< Достижения >
 ________
|   _    | 1. Спустя час
|  / |   | Получить 1 уровень
|    |   |
|  ‾‾‾‾  |
 ‾‾‾‾‾‾‾‾
 ________
|   _    | 2. Ветки
|  <`)   | Открыть дерево
|  ( \_  |
|   ""   |
 ‾‾‾‾‾‾‾‾

''', '''Секунды   : 9,999,999,999,999 | Профиль : Catalyst
Минуты    : 282               | Уровень : 2,390
Часы      : 2                 | Доллары : 523,421,432,234$

< Магазин >

1. Железный доспех - 320 минут
2. Осадочная порода - 31 минут
3. Кремнелитовый меч - 5,000 минут
4. Свинцовая стружка - 10 минут
''', '''

''']

'''
12 > 24 > 48 > 72
'''
print(text[-1])
